#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<div class="highlight highlight-source-shell"><pre>terraform
Acquiring state lock. This may take a few moments...
cloudflare_zone.vortex_name: Refreshing state... [id=af76b9090f6e819df8e36ba0d850b2fd]
cloudflare_zone.tiamat_tech: Refreshing state... [id=c243e00ae6d4f6b053f8662558543fd8]
module.terraform_state_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=zerovortex-prod-terraform-state-lock]
module.terraform_state_backend.aws_s3_bucket.default: Refreshing state... [id=zerovortex-prod-terraform-state]
cloudflare_record.vortexdotname_A_vortex_name_github2: Refreshing state... [id=27a706cb484132c828f62f688bf14012]
cloudflare_record.vortexdotname_A_vortex_name_github4: Refreshing state... [id=ca8f88bf1defbd28f726fbe295d445e5]
cloudflare_record.vortexdotname_A_vortex_name_github3: Refreshing state... [id=ecb1dc6b91878257f5f4989587bd10ce]
cloudflare_record.vortexdotname_CNAME_tedvortex-xyz_vortex_name: Refreshing state... [id=4e620220dcb430ab1bef7015ab830f1d]
cloudflare_record.vortexdotname_AAAA_connect-with_vortex_name: Refreshing state... [id=b60ffa44bebdbd7e0b6c425f2354487c]
cloudflare_page_rule.vortexdotname_https_rewrite: Refreshing state... [id=311e6be3848d509da7054c0bda6a44b5]
cloudflare_record.vortexdotname_A_vortex_name_github1: Refreshing state... [id=937a92dc0b3b551d91dd9f3c400c33ef]
cloudflare_record.vortexdotname_CNAME_dotfiles_vortex_name: Refreshing state... [id=57a283ace4c5c18c029086ad2d44767d]
cloudflare_record.vortexdotname_CNAME_terraform_vortex_name: Refreshing state... [id=335cf700c8f5587652e6691d4e65aa11]
cloudflare_record.vortexdotname_AAAA_workers_vortex_name: Refreshing state... [id=79450f80dd47b92f1760b6999e09ff6d]
cloudflare_record.tiamatdottech_A_tiamat_tech_github2: Refreshing state... [id=1201091fd460ebc9ea8dba14eaf66bb3]
cloudflare_record.tiamatdottech_A_tiamat_tech_github1: Refreshing state... [id=10a0d95ac27373ed21c6d7731aa68a25]
cloudflare_record.tiamatdottech_MX_google1: Refreshing state... [id=1a102839a3922c38bb442ba74820ca69]
cloudflare_record.tiamatdottech_TXT_atlassian: Refreshing state... [id=c21531ed3eda60e2410c641e99bd00fe]
cloudflare_record.tiamatdottech_MX_google2: Refreshing state... [id=9c0162fb1b52e041a15cd2b5d678135e]
cloudflare_record.tiamatdottech_MX_google3: Refreshing state... [id=657e7c65403ffa05b3b3c6e89433020c]
cloudflare_record.tiamatdottech_TXT_github: Refreshing state... [id=388f5e5b90f3791fbc8b22c14e513cfc]
cloudflare_record.tiamatdottech_TXT_dmarc: Refreshing state... [id=9985ef658850eae287e8e6f07ea64fe5]
cloudflare_record.tiamatdottech_A_tiamat_tech_github3: Refreshing state... [id=2ef48ca558fa4672cd1501e1a09863d3]
cloudflare_record.tiamatdottech_TXT_google_domainkey: Refreshing state... [id=a5d88b3bf3e587239bebc96178423137]
cloudflare_record.tiamatdottech_A_tiamat_tech_github4: Refreshing state... [id=7ada4b5191e917d2ef8875a4b9f6687f]
cloudflare_page_rule.tiamatdottech_https_rewrite: Refreshing state... [id=46f4e509580c87db5582abfe2000f9cb]
cloudflare_record.tiamatdottech_CNAME_uptime: Refreshing state... [id=f22cd27bb18672d9ba41f69aead5f261]
cloudflare_record.tiamatdottech_MX_google4: Refreshing state... [id=99859e130b79f92c6f45bdd712775118]
cloudflare_record.tiamatdottech_TXT_google_site_verification: Refreshing state... [id=4fb03189b6213e0e954f6937e092c842]
cloudflare_record.tiamatdottech_TXT_spf: Refreshing state... [id=7e3b27113230f7e53fa1c323adadce5d]
cloudflare_record.tiamatdottech_CNAME_drive: Refreshing state... [id=9812f54bb53e413de83d0362dc80fd07]
cloudflare_record.tiamatdottech_MX_google5: Refreshing state... [id=1af272bf4cde1521e1d5c908b051335b]
cloudflare_record.tiamatdottech_CNAME_calendar: Refreshing state... [id=eafc738ddad3b29119a7eb6c4aa69016]
cloudflare_record.tiamatdottech_CNAME_mail: Refreshing state... [id=599c32a4e877a634c503f714bfa13585]
module.terraform_state_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=zerovortex-prod-terraform-state]
module.terraform_state_backend.local_file.terraform_backend_config[0]: Refreshing state... [id=3eb7e7d89496f3d03514b9ad844f61c407fe1546]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.vortexdotname_CNAME_dark-elise_vortex_name will be created
  + resource "cloudflare_record" "vortexdotname_CNAME_dark-elise_vortex_name" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "derk-elise"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "0-vortex.github.io"
      + zone_id     = "af76b9090f6e819df8e36ba0d850b2fd"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
</pre></div>
</details>

*Pusher: @0-vortex, Action: `pull_request`*